HELYXcore-4.4.0/examples/legacy/compressible/rhoCentralFoam/biconic25-55Run35/0/T
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar>
32385
(
1404.43491535448
1147.81195002889
981.086534220602
876.555180268065
806.157285562579
756.054012665781
718.015960549465
687.715473979171
...
)
;

boundaryField
{
    cone
    {
        type            smoluchowskiJumpT;
        accommodationCoeff 0.85;
        Twall           uniform 296.1;
        gamma           1.4;
        value           nonuniform List<scalar>
255
(
1402.47638056061
1145.21495123694
977.998692800111
873.051272839844
802.310182899083
751.906715671458
713.588077903897
683.023362034537
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 138.9;
    }
    centreLeft
    {
        type            symmetry;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}

// ************************************************************************* //
