HELYXcore-4.4.0/examples/legacy/compressible/rhoCentralFoam/biconic25-55Run35/system/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

materialType    fluid;
muModel         muSutherland;
kappaModel      kappaSutherland;
thermodynamics  janaf;
equationOfState perfectGas;
energy          sensibleInternalEnergy;
molWeight       28.01348;

thermodynamicsCoeffs
{
    Tlow            100;
    Thigh           10000;
    Tcommon         1000;
    highCpCoeffs    ( 2.9525407 0.0013968838 -4.9262577e-07 7.8600091e-11 -4.6074978e-15 -923.93753 5.8718221 );
    lowCpCoeffs     ( 3.5309628 -0.0001236595 -5.0299339e-07 2.4352768e-09 -1.4087954e-12 -1046.9637 2.9674391 );
}
muModelCoeffs
{
    As              1.458e-06;
    Ts              110;
}
kappaModelCoeffs
{
    Pr              0.72;
}


// ************************************************************************* //
